Autodesk.Revit.DB.SolidOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SolidOptions.ExtraFaceAndEdgeHistoryKey
Optional extra key used to create face and edge histories for the Solid.
If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid.
Since:
2015

Autodesk.Revit.DB.SolidOptions.GraphicsStyleId
Defines the graphics style id for the Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.SolidOptions.MaterialId
Defines the material id for the Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.SolidOptions.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new SolidOptions class with material and graphics style settings.
materialId:
The material id for the Solid.
graphicsStyleId:
The graphics style id for the Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.SolidOptions
A class containing optional information to control the properties of the Solid generated by the GeometryCreationUtilities routines.
Since:
2015